# ColumnAttachment Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
ColumnAttachment Class
Members See Also
---
An object representing the attachment of the top or bottom of a column to some target: a floor, roof, ceiling, beam, or brace.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public class ColumnAttachment : IDisposable
```

Visual Basic
---
```text
Public Class ColumnAttachment _
	Implements IDisposable
```

Visual C++
---
```text
public ref class ColumnAttachment : IDisposable
```

# Remarks
Call IsValidColumn() and IsValidTarget() to verify that specific elements support column attachments. A column has at most one top attachment and one bottom attachment.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..ColumnAttachment
# See Also
ColumnAttachment Members
Autodesk.Revit.DB Namespace